[{"model": "products.category", "pk": 1, "fields": {"name": "motors", "friendly_name": "Motors"}}, {"model": "products.category", "pk": 2, "fields": {"name": "accessories", "friendly_name": "Accessories"}}, {"model": "products.category", "pk": 3, "fields": {"name": "esc", "friendly_name": "ESC"}}, {"model": "products.product", "pk": 1, "fields": {"category": 1, "sku": "SU-50011", "name": "SURPASS V4S Stock ROAR Brushless Sensored Motor 10.5T -  27.5T", "description": "<p>Surpass introduce their latest motor to the market the V4S. </p>\r\n<p>Many improvements have been made from the already excellent V3, the V4S has an open design to massively reduce internal heat and increase the performance of the motor especially in the later stages of a race when temperature can start affect the performance.</p>\r\n<p>Surpass manufacture many brands of motors and are experienced in producing motors of the highest quality. All Motors come with a flat sensor lead and are BRCA, EFRA and IFMAR legal. The image is for reference, the correct wind will be shipped.</p>", "turns": true, "price": "60.00", "rating": null, "image_url": null, "image": "surpass_motor.jpg"}}, {"model": "products.product", "pk": 2, "fields": {"category": 2, "sku": "HI-635442", "name": "HPI LiPo Safe Case", "description": "Charge your LiPo batteries with complete confidence using the HPI LiPo Safe Case!\r\n\r\nThe HPI LiPo Safe Case offers you efficient protection for all types of RC LiPo batteries while storing, transporting, charging or cycling your NiMH or LiPo batteries. The LiPo Safe Case is flameproof and provides superior protection for you and your home from overcharged or damaged batteries.\r\n\r\nApprox. internal dimension: 70 x 70 x 160mm", "turns": false, "price": "20.00", "rating": null, "image_url": null, "image": "lipo_bag.jpg"}}, {"model": "products.product", "pk": 3, "fields": {"category": 2, "sku": "AS-12345", "name": "Turnbuckle Wrench", "description": "This product is made from high quality materials, and it is designed for lasting performance. It will fit most 1/8 and 1/10 off-road vehicles.", "turns": false, "price": "8.00", "rating": null, "image_url": null, "image": "turnbuckle_wrench.jpg"}}, {"model": "products.product", "pk": 4, "fields": {"category": 2, "sku": "BB-52423", "name": "Ball Bearing - 10x15x4 Red Seal - (pr)", "description": "Ball Bearing - 10x15x4 Red Seal - (pr)", "turns": false, "price": "4.00", "rating": null, "image_url": null, "image": "bearings.jpg"}}, {"model": "products.product", "pk": 5, "fields": {"category": 1, "sku": "RS-28001", "name": "Reedy Sonic 540 M4 Brushless Sensored Motor 10.5T - 27.5T", "description": "Internally, the 540-M4 is very similar to that of the 540-M3 that it replaces - it produces the same linear powerband and excellent mid-range feel that have become synonymous with Reedy’s modified motors. However, changes can be good when they serve a purpose. In the case of the 540-M4, the inner bearing has been moved so that it is part of the can instead of the sensor assembly, which more precisely aligns the rotor within the magnetic field while reducing noise and vibration.", "turns": true, "price": "85.00", "rating": null, "image_url": null, "image": "reedy_motor_TyRmffb.jpg"}}, {"model": "products.product", "pk": 13, "fields": {"category": 1, "sku": "SR-33302", "name": "ARES PRO V2.1  BRUSHLESS MOTOR 1/10 SENSORED 10.5T-27.5T", "description": "<p>In more dazzling shape featuring multiple cooling engraved fins for added heat-dissipating surface area, the motor is implementing thermal silicone insulator between the endbell and stator to conduct the internal heat to the case with the temperate reduced efficiently, and power output multiplied!</p>\r\n<ul>\r\n<li>Aluminum Shell with CNC Forming Process</li>\r\n<li>Pure Copper Coil with High Conductivity</li>\r\n<li>High Power Welding Pieces</li>\r\n<li>Replaceable Rotor</li>\r\n<li>Powerful Sintered Neodymium Magnet</li>\r\n<li>Seiko in Manufacturing with Maximum Energy Conversion</li>\r\n<li>IFMAR, ROAR Compliance</li>\r\n</ul>", "turns": true, "price": "70.00", "rating": null, "image_url": null, "image": "ares_motor.jpg"}}, {"model": "products.product", "pk": 14, "fields": {"category": 1, "sku": "LR-20001", "name": "LRP Vector X20 BL StockSpec 10.5T - 27.5T", "description": "<p>Vector X20 technology also for stock racing!</p>\r\n<p>Based on the extremely successful Vector X20 Modified Brushless motors, LRP developed special Stock racing motors. Innovative features like the dual axis balanced dynamic rotor, finely adjustable five-step timing or the optimised compact stack for better drive feeling and higher efficiency have been taken over to the X20 StockSpec</p>\r\n<p>The motors are available in the specific windings for Stock racing. They are extremely powerful, low maintenance and comply to the rules of the international and national Stock classes.</p>\r\n<p>Complying with the rules of the following federations: IFMAR / EFRA / DMC / BRCA / JMRCA\r\n</p>\r\n<ul>\r\n<li>Advanced StockSpec magnet - Race-legal high-strength magnet for maximum performance</li>\r\n<li>Easy-Tech features - Black coated shaft and magnet, laser-engraved turns and rotor, sealed winding</li>\r\n<li>5 timing inserts - Finer timing adjustments, inserts now with degree markings</li>\r\n<li>Oversized ABEC 5 ball-bearings - Larger sized ABEC 5 bearings for maximum durability</li>\r\n<li>O-ring dampening - For vibration-free operation even under highest rpms</li>\r\n<li>EasySolder design - Heavy copper, 6-layer PCB for lowest resistance</li>\r\n</ul>", "turns": true, "price": "90.00", "rating": null, "image_url": null, "image": "lrp_motor.jpg"}}, {"model": "products.product", "pk": 15, "fields": {"category": 2, "sku": "FS-65200", "name": "1:10 Shock Absorber Building Station Black", "description": "Shocks and Hardware not included.", "turns": false, "price": "6.00", "rating": null, "image_url": null, "image": "station.jpg"}}, {"model": "products.product", "pk": 16, "fields": {"category": 3, "sku": "XR-546821", "name": "XeRun XR10 Pro G2 Brushless ESC Black 160A", "description": "<p>The XeRun XR10 Pro G2 ESC has a lots of new advanced features and a 32-bit high-performance processor.</p>\r\n<p>Battery Reverse Polarity Protection. It has been designed with a very unique feature protecting your ESC from damage caused by Battery Reverse Polarity, so no matter how many times you reverse the battery connections the XR10 Pro G2 ESC, the paired motor and the battery are safe from damage.</p>\r\n,p>More accurate Throttle PWM and Brake PWM adjustment, more options for Turbo Increase Rate and Turbo Decrease Rate.\r\nMore options for \"Maximum Brake Force\" setting, 101%--150% (Active Brake) are available for some special applications such as Stock race with very aggressive gear ratio.</p>\r\n\r\n<ul>\r\n<li>Battery Reverse Polarity Protection</li>\r\n<li>More accurate Throttle PWM and Brake PWM adjustment</li>\r\n<li>More options for Turbo Increase Rate and Turbo Decrease Rate</li>\r\n<li>More options for \"Maximum Brake Force\" settings</li>\r\n</ul>", "turns": false, "price": "215.00", "rating": null, "image_url": null, "image": "xerun_xr10.jpg"}}, {"model": "products.product", "pk": 17, "fields": {"category": 3, "sku": "QR-76521", "name": "QuicRun 10BL120 120A Sensored ESC", "description": "<ul>\r\n<li>Sensored ESC</li>\r\n<li>Waterproof: no</li>\r\n<li>Cont.Current: 120A</li>\r\n<li>Peak Current: 720A</li>\r\n<li>For 2S Lipo or 4-6 cells NiMH</li>\r\n</ul>", "turns": false, "price": "55.00", "rating": null, "image_url": null, "image": "quickrun.jpg"}}, {"model": "products.review", "pk": 3, "fields": {"product": 3, "review_author": 1, "review_text": "33", "date_created": "2021-05-27T01:47:00.567Z"}}, {"model": "news.news", "pk": 3, "fields": {"author": 1, "date_created": "2021-05-20T16:43:29.150Z", "title": "Fast & Furious RC Car Club Guide for Beginners", "introduction": "We have put this getting started section together to try and help you get started with model car racing in Ireland. From our experience we have had many potential members arrive along at our club with a car unsuitable to race. Mostly its because of what someone read on the internet about this or that car, but you cant beat advice you will get from local racers. We are not saying you should buy the most expensive or fastest car, on the contrary, we would like to help you choose the right car for your ability and budget, taking in some of the factors below.", "content": "<p>You will learn more by dropping by and talking to racers and looking at what we have for a half hour than you will with a week on the net At the very least send us an email and we will do our best to advise you.</p>\r\n<p>The track is open every wednesday evening from 7pm, this is a great time to come by and speak with us as the club members will have plenty of time to chat as we are only practising.</p>\r\n<p>At the FFRCCC we race electric cars only, at the moment only 1/10th off-road. The cars are loosely based on Baja Buggies or Sandrails. They are powered by lithium polymer (LiPo) batteries similar to what`s used in laptops. There are a number of different brands and routes you can take to get into RC car racing, but some of the main points you should consider before you buy are:</p>\r\n<ol>\r\n<li>Can you get parts easily? You will break or wear out parts on your car, and if you cannot replace these easily, your car will become useless.</li>\r\n<li>Can you get help and advice about your car? If you have a car that no one in the club knows about, it can be hard for experienced members to advise you or help you fix it when it breaks.</li>\r\n</ol>\r\n<p>There are two ways you can buy your car, either buy a kit and all the various parts required or you can buy a Ready to Run (RTR) setup. A RTR comes with everything you need except a battery and charger. Both ways have their advantages and disadvantages.</p>\r\n<p>RTR usually don’t have top of the line electronics, and some alloy parts are replaced with plastic parts. Though these cars run perfectly well and many FFRCCC members use them. They also work out a cheaper route. It’s a great simple way to get up and running.</p>\r\n<p>A kit means you will need to research all the extra parts you require to run your car, it works out more expensive, but it can be tailored exactly to your needs. It also means since you need to put it together yourself, you know how to fix it when it breaks. Though this is quite a steep learning curve</p>\r\n<p>At the FFRCCC we race two wheel drive and four wheel drive. Beginners are best advised to start with two wheel drive. Some people think 4WD is cooler, more advanced etc. but trust us when we tell you to start with the simpler 2WD.</p>\r\n<p>There are also two classes Clubman, where there are restrictions on the type of motor and Open Class where there are no restrictions. Again, beginners will need to start with Clubman.</p>\r\n<p class=\"text-danger\">The best advice we could give is to speak with members of the DMCC and ask them for help and advice before you buy. All members are very open and willing to help anyone interested in the hobby.</p>", "last_updated": "2021-05-20T17:37:10.854Z"}}, {"model": "news.comment", "pk": 20, "fields": {"news": 3, "comment_author": 1, "comment_text": "hi", "date_created": "2021-05-27T01:23:21.512Z"}}, {"model": "news.comment", "pk": 21, "fields": {"news": 3, "comment_author": 1, "comment_text": "hi", "date_created": "2021-05-27T01:47:46.036Z"}}]